addenum/app/controllers/addendums_controller.rb

  def create
    @add  = Addendum.create(task_params)
---
INSERT INTO "addendums" ("addendum_content_type", "addendum_file_name", "addendum_file_size", "addendum_updated_at", "created_at", "description", "name", "podcast_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

    def set_tasks
       @add = Addendum.find(params[:id])
---
SELECT  "addendums".* FROM "addendums"  WHERE "addendums"."id" = ? LIMIT 1  [["id", 1]]