addenum/app/controllers/podcasts_controller.rb

INSERT INTO "podcasts" ("cast_content_type", "cast_file_name", "cast_file_size", "cast_updated_at", "created_at", "description", "name", "podpage_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
 def create
   @task  = Podcast.create(task_params)

SELECT "addendums".* FROM "addendums"  WHERE "addendums"."podcast_id" = 2
SELECT  "podcasts".* FROM "podcasts"  WHERE "podcasts"."id" = ? LIMIT 1  [["id", 14]]
---
 def show
   @adds = Addendum.all
   @pcast = Podcast.find(params[:id])

SELECT  "podcasts".* FROM "podcasts"  WHERE "podcasts"."id" = ? LIMIT 1  [["id", 2]]
---
   def set_tasks
      @task = Podcast.find(params[:id])