addenum/app/controllers/podpages_controller.rb

INSERT INTO "podpages" ("created_at", "description", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-10-27 00:32:07.810389"], ["description", "im testing this new podpage"], ["name", "Testpodpage"], ["updated_at", "2015-10-27 00:32:07.810389"]]
INSERT INTO "subscriptions" ("created_at", "podpage_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2015-10-30 19:00:43.689911"], ["podpage_id", 1], ["updated_at", "2015-10-30 19:00:43.689911"], ["user_id", 1]]
---
 def create
   @ppage  = Podpage.create(name:ppage_params[:name],description:ppage_params[:description])
   Subscription.create(user_id: session[:user_id], podpage_id: @ppage.id)

SELECT "podcasts".* FROM "podcasts"  WHERE "podcasts"."podpage_id" = 7
SELECT  "podpages".* FROM "podpages"  WHERE "podpages"."id" = ? LIMIT 1  [["id", 2]]
---
 def show
     #@songs = Podcast.all.cast.url
     @tasks = Podcast.where(podpage_id:params[:id])
     @ppage = Podpage.find(params[:id])

SELECT  "podpages".* FROM "podpages"  WHERE "podpages"."id" = ? LIMIT 1  [["id", 1]]
---
   def set_tasks
      @ppage = Podpage.find(params[:id])