addenum/app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."email" = 'john.jam@bim.bam' LIMIT 1
---
  def create
    flash[:danger] = []
    user = User.find_by(email: params[:session][:email])