addenum/app/controllers/subscriptions_controller.rb

INSERT INTO "subscriptions" ("created_at", "podpage_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2015-10-30 19:43:12.623559"], ["podpage_id", 1], ["updated_at", "2015-10-30 19:43:12.623559"], ["user_id", 2]]
---
  def create
    puts session[:user_id]
    puts params[:podpage_id]
    puts "above should hold the feilds we're passing"
    Subscription.create(user_id: session[:user_id], podpage_id: params[:podpage_id])