addenum/app/controllers/users_controller.rb

SELECT "podpages".* FROM "podpages"  WHERE "podpages"."id" IN (SELECT "subscriptions"."podpage_id" FROM "subscriptions"  WHERE "subscriptions"."user_id" = 1)
---
  def index
    @pages = Podpage.all

INSERT INTO "users" ("created_at", "email", "name", "password_digest", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    user = User.new(user_params)
    if user.save