addenum/app/views/users/index.html.erb

SELECT  "users".* FROM "users"  WHERE "users"."id" = 1 LIMIT 1
---
    <%= image_tag("Addendum_sm.png",class: 'valign', :alt => "rss feed") %>
    <h5>Welcome back <%= User.find_by(id: session[:user_id]).name%></h5>